---
title: BuiltInExternalServices
classe: Autodesk.Revit.DB.ExternalService.ExternalServices+BuiltInExternalServices
namespace: Autodesk.Revit.DB.ExternalService
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 52
---

# BuiltInExternalServices

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExternalServiceId AlignmentService { get; }` | `BuiltInExternalServices.AlignmentService` | ExternalServiceId |
| `ExternalServiceId AnalyticalCurrentCalculationService { get; }` | `BuiltInExternalServices.AnalyticalCurrentCalculationService` | ExternalServiceId |
| `ExternalServiceId ATFTranslationService { get; }` | `BuiltInExternalServices.ATFTranslationService` | ExternalServiceId |
| `ExternalServiceId AXMImporterService { get; }` | `BuiltInExternalServices.AXMImporterService` | ExternalServiceId |
| `ExternalServiceId CloudExternalService { get; }` | `BuiltInExternalServices.CloudExternalService` | ExternalServiceId |
| `ExternalServiceId CodeCheckingParameterService { get; }` | `BuiltInExternalServices.CodeCheckingParameterService` | ExternalServiceId |
| `ExternalServiceId ConnectionTypeChangedService { get; }` | `BuiltInExternalServices.ConnectionTypeChangedService` | ExternalServiceId |
| `ExternalServiceId CustomFieldEditPropertiesService { get; }` | `BuiltInExternalServices.CustomFieldEditPropertiesService` | ExternalServiceId |
| `ExternalServiceId CustomFieldService { get; }` | `BuiltInExternalServices.CustomFieldService` | ExternalServiceId |
| `ExternalServiceId DirectContext3DService { get; }` | `BuiltInExternalServices.DirectContext3DService` | ExternalServiceId |
| `ExternalServiceId DuctFittingAndAccessoryPressureDropService { get; }` | `BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService` | ExternalServiceId |
| `ExternalServiceId DuctFittingAndAccessoryPressureDropUIService { get; }` | `BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService` | ExternalServiceId |
| `ExternalServiceId DuctPressureDropService { get; }` | `BuiltInExternalServices.DuctPressureDropService` | ExternalServiceId |
| `ExternalServiceId ElectricalAnalyticalLoadCombinationUIService { get; }` | `BuiltInExternalServices.ElectricalAnalyticalLoadCombinationUIService` | ExternalServiceId |
| `ExternalServiceId ElectricalAnalyticalLoadSetUIService { get; }` | `BuiltInExternalServices.ElectricalAnalyticalLoadSetUIService` | ExternalServiceId |
| `ExternalServiceId EntitlementExternalService { get; }` | `BuiltInExternalServices.EntitlementExternalService` | ExternalServiceId |
| `ExternalServiceId ExternalDataManagerService { get; }` | `BuiltInExternalServices.ExternalDataManagerService` | ExternalServiceId |
| `ExternalServiceId ExternalDataTypeService { get; }` | `BuiltInExternalServices.ExternalDataTypeService` | ExternalServiceId |
| `ExternalServiceId ExternalParameterService { get; }` | `BuiltInExternalServices.ExternalParameterService` | ExternalServiceId |
| `ExternalServiceId ExternalResourceService { get; }` | `BuiltInExternalServices.ExternalResourceService` | ExternalServiceId |
| `ExternalServiceId ExternalResourceUIService { get; }` | `BuiltInExternalServices.ExternalResourceUIService` | ExternalServiceId |
| `ExternalServiceId ExternalUIService { get; }` | `BuiltInExternalServices.ExternalUIService` | ExternalServiceId |
| `ExternalServiceId ForgeSchemaService { get; }` | `BuiltInExternalServices.ForgeSchemaService` | ExternalServiceId |
| `ExternalServiceId FramingProfileService { get; }` | `BuiltInExternalServices.FramingProfileService` | ExternalServiceId |
| `ExternalServiceId GenericRepoHelperService { get; }` | `BuiltInExternalServices.GenericRepoHelperService` | ExternalServiceId |
| `ExternalServiceId GeometryAugmentationService { get; }` | `BuiltInExternalServices.GeometryAugmentationService` | ExternalServiceId |
| `ExternalServiceId HoleDefinitionService { get; }` | `BuiltInExternalServices.HoleDefinitionService` | ExternalServiceId |
| `ExternalServiceId IFCEntityTreeUIService { get; }` | `BuiltInExternalServices.IFCEntityTreeUIService` | ExternalServiceId |
| `ExternalServiceId IFCExporterService { get; }` | `BuiltInExternalServices.IFCExporterService` | ExternalServiceId |
| `ExternalServiceId IFCImporterService { get; }` | `BuiltInExternalServices.IFCImporterService` | ExternalServiceId |
| `ExternalServiceId MacroManagerUIService { get; }` | `BuiltInExternalServices.MacroManagerUIService` | ExternalServiceId |
| `ExternalServiceId MemberForcesService { get; }` | `BuiltInExternalServices.MemberForcesService` | ExternalServiceId |
| `ExternalServiceId ModelAccessValidationService { get; }` | `BuiltInExternalServices.ModelAccessValidationService` | ExternalServiceId |
| `ExternalServiceId ModifyConnectionParametersService { get; }` | `BuiltInExternalServices.ModifyConnectionParametersService` | ExternalServiceId |
| `ExternalServiceId ModifyConnectionRangesService { get; }` | `BuiltInExternalServices.ModifyConnectionRangesService` | ExternalServiceId |
| `ExternalServiceId NavisworksExporterService { get; }` | `BuiltInExternalServices.NavisworksExporterService` | ExternalServiceId |
| `ExternalServiceId PathOfTravelCalculationService { get; }` | `BuiltInExternalServices.PathOfTravelCalculationService` | ExternalServiceId |
| `ExternalServiceId PipeFittingAndAccessoryPressureDropService { get; }` | `BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService` | ExternalServiceId |
| `ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }` | `BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService` | ExternalServiceId |
| `ExternalServiceId PipeFrictionFactorService { get; }` | `BuiltInExternalServices.PipeFrictionFactorService` | ExternalServiceId |
| `ExternalServiceId PipePlumbingFixtureFlowService { get; }` | `BuiltInExternalServices.PipePlumbingFixtureFlowService` | ExternalServiceId |
| `ExternalServiceId PipePressureDropService { get; }` | `BuiltInExternalServices.PipePressureDropService` | ExternalServiceId |
| `ExternalServiceId RebarSpliceService { get; }` | `BuiltInExternalServices.RebarSpliceService` | ExternalServiceId |
| `ExternalServiceId RebarUpdateService { get; }` | `BuiltInExternalServices.RebarUpdateService` | ExternalServiceId |
| `ExternalServiceId RevisionsOnSheetUIService { get; }` | `BuiltInExternalServices.RevisionsOnSheetUIService` | ExternalServiceId |
| `ExternalServiceId SiteInsertService { get; }` | `BuiltInExternalServices.SiteInsertService` | ExternalServiceId |
| `ExternalServiceId SiteLinkerUIService { get; }` | `BuiltInExternalServices.SiteLinkerUIService` | ExternalServiceId |
| `ExternalServiceId SnappingService { get; }` | `BuiltInExternalServices.SnappingService` | ExternalServiceId |
| `ExternalServiceId StructuralSectionsService { get; }` | `BuiltInExternalServices.StructuralSectionsService` | ExternalServiceId |
| `ExternalServiceId TemporaryGraphicsHandlerService { get; }` | `BuiltInExternalServices.TemporaryGraphicsHandlerService` | ExternalServiceId |
| `ExternalServiceId ViewSheetSetUIService { get; }` | `BuiltInExternalServices.ViewSheetSetUIService` | ExternalServiceId |
| `ExternalServiceId WallPlacementPostProcessingService { get; }` | `BuiltInExternalServices.WallPlacementPostProcessingService` | ExternalServiceId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```